#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.single_zone.data.archive_file.revalidation_function[0]: Reading...
module.single_zone.data.archive_file.warmer_function[0]: Reading...
module.single_zone.data.archive_file.image_optimisation_function[0]: Reading...
module.single_zone.data.archive_file.revalidation_function[0]: Read complete after 0s [id=786bbba981cea14007d78f5fa68a31771ffaea8a]
module.single_zone.data.archive_file.warmer_function[0]: Read complete after 0s [id=e5094e337d97bf663bebb451657f5785a9dda36d]
module.http-redirect.aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:615299762949:certificate/c69ccd6e-eece-4944-b5d5-e191ea5376aa]
module.single_zone.module.public_resources[0].data.aws_region.current: Reading...
module.single_zone.module.public_resources[0].aws_cloudfront_origin_access_control.website_origin_access_control: Refreshing state... [id=E3RNQ0V4MAIQ68]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Reading...
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Reading...
module.single_zone.module.public_resources[0].aws_cloudfront_function.x_forwarded_host: Refreshing state... [id=vltech-website-x-forwarded-host-function]
module.single_zone.module.public_resources[0].aws_cloudfront_cache_policy.cache_policy[0]: Refreshing state... [id=06efa7e0-f0db-4669-832e-5b76036eb9b1]
module.single_zone.module.public_resources[0].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.single_zone.module.public_resources[0].data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.single_zone.module.public_resources[0].data.aws_cloudfront_origin_request_policy.all_viewer_except_host_header: Read complete after 0s [id=b689b0a8-53d0-40ab-baf2-68738e2966ac]
module.http-redirect.data.aws_route53_zone.zone: Reading...
module.single_zone.module.server_function.data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Reading...
module.http-redirect.aws_cloudfront_function.redirect: Refreshing state... [id=http-redirect]
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Reading...
module.single_zone.module.image_optimisation_function[0].data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.server_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.aws_s3_bucket.bucket[0]: Refreshing state... [id=vltech-website-website-bucket]
module.single_zone.aws_sqs_queue.revalidation_queue: Refreshing state... [id=https://sqs.eu-central-1.amazonaws.com/615299762949/vltech-website-isr-queue.fifo]
module.single_zone.module.server_function.data.aws_caller_identity.current: Reading...
module.single_zone.aws_dynamodb_table.isr_table[0]: Refreshing state... [id=vltech-website-isr-tag-mapping]
data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.revalidation_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-revalidation-function-role]
module.http-redirect.data.aws_route53_zone.zone: Read complete after 0s [id=Z01305181G23H04WP32YA]
module.single_zone.module.server_function.aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-server-function-role]
module.single_zone.module.image_optimisation_function[0].data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.open_next_aliases[0].aws_ssm_parameter.origin_aliases: Refreshing state... [id=vltech-website-website-origin-aliases]
module.single_zone.module.image_optimisation_function[0].aws_iam_role.lambda_iam: Refreshing state... [id=vltech-website-image-optimization-function-role]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Reading...
module.single_zone.module.server_function.data.aws_caller_identity.current: Read complete after 0s [id=615299762949]
module.single_zone.module.revalidation_function.data.aws_region.current: Reading...
module.single_zone.module.revalidation_function.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.data.aws_region.current: Reading...
module.single_zone.data.aws_region.current: Read complete after 0s [id=eu-central-1]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Reading...
module.http-redirect.aws_route53_record.cert_validation["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA__abc41aced5334d86bdd43adac171c372.victorlevasseur.tech._CNAME]
module.single_zone.data.archive_file.image_optimisation_function[0]: Read complete after 1s [id=43c0451d05f4e1e788889dfd869157de643bb1de]
module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-revalidation-function]
module.single_zone.module.revalidation_function.data.aws_caller_identity.current: Read complete after 1s [id=615299762949]
module.single_zone.module.revalidation_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-revalidation-function]
module.single_zone.module.server_function.aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-server-function]
module.single_zone.module.public_resources[0].data.aws_route53_zone.hosted_zone["victorlevasseur.tech-false"]: Read complete after 1s [id=Z01305181G23H04WP32YA]
module.single_zone.module.image_optimisation_function[0].aws_cloudwatch_log_group.lambda_log_group[0]: Refreshing state... [id=/aws/lambda/vltech-website-image-optimization-function]
module.http-redirect.aws_acm_certificate_validation.cert: Refreshing state... [id=2025-02-13 14:11:52.205 +0000 UTC]
module.http-redirect.aws_cloudfront_distribution.distribution: Refreshing state... [id=E3AXV12PY17NPX]
module.http-redirect.aws_route53_record.main["victorlevasseur.tech"]: Refreshing state... [id=Z01305181G23H04WP32YA_victorlevasseur.tech_A]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Reading...
module.single_zone.module.revalidation_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-revalidation-function-lambda-policy]
module.single_zone.module.revalidation_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-revalidation-function-role-20241218205629363600000001]
module.single_zone.module.open_next_aliases[0].data.aws_ssm_parameter.origin_aliases: Read complete after 0s [id=vltech-website-website-origin-aliases]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/favicon.ico/layout"]: Refreshing state... [id=2906da3c-eaab-f9c0-e3d8-d9a4f95ef27b]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/cgv"]: Refreshing state... [id=7b9c399d-bbfd-c09f-7b26-33d2ffe87d59]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/_not-found"]: Refreshing state... [id=21d805b7-4a6c-9d2c-02c9-678cd14b746c]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/favicon.ico/route"]: Refreshing state... [id=c8339ce0-1c45-ad88-2132-1674312854e4]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/apple-icon.png"]: Refreshing state... [id=a8eec600-d9eb-21ce-fc0d-dd77945a7e11]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/apple-icon.png/layout"]: Refreshing state... [id=34287888-fa99-1d78-ea57-aa6c0edc4c86]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/sitemap.xml/layout"]: Refreshing state... [id=aa59df35-b141-433d-317e-26f2085561c5]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/cgv"]: Refreshing state... [id=899bda51-4dac-f585-ac7b-8cbad450fd98]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/page"]: Refreshing state... [id=a7679c53-8bd4-65ac-cd11-ad1dcdb5d108]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/"]: Refreshing state... [id=74092b7a-5c8e-df5c-38cf-9bdebedaa5d5]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/sitemap.xml"]: Refreshing state... [id=9a3ed01b-5ae6-a5cc-96c1-a08b4ced16ce]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/favicon.ico"]: Refreshing state... [id=9082afe5-99d0-2f6a-5d93-1380e745548b]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/_not-found/layout"]: Refreshing state... [id=5be345a3-273c-381f-5795-e9fe2ba60508]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/_not-found"]: Refreshing state... [id=77467906-be1b-57fe-87fa-4b54b2e9ce02]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/icon.svg/route"]: Refreshing state... [id=5babcda4-3126-bd91-1e4c-4ea052491582]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/_not-found/page"]: Refreshing state... [id=dfcec426-fe94-edee-6ae2-9d0cbd141155]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/sitemap.xml"]: Refreshing state... [id=f4464299-75c6-b2c4-b5f8-c10ddd3dd645]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/icon.svg"]: Refreshing state... [id=d3d20e9c-376f-f2e6-e3b9-288d155543e8]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/cgv/layout"]: Refreshing state... [id=1ca5643d-4af6-5fd0-ba47-de8f058ea86e]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/icon.svg/layout"]: Refreshing state... [id=5c5acc8b-2aa1-32a8-98ff-c6fb9400112f]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/icon.svg"]: Refreshing state... [id=174d39b7-0ef8-aefe-90d3-81179388dfd2]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/apple-icon.png/route"]: Refreshing state... [id=18b6274d-b97b-da96-cfb2-d17e46a57710]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/sitemap.xml/route"]: Refreshing state... [id=e8535260-7e85-9cc7-9c99-b9cdb06bb020]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/cgv/page"]: Refreshing state... [id=351bb9c0-0f58-471f-9fbe-f6144308107e]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/favicon.ico"]: Refreshing state... [id=d05a4d8c-3fa9-b1c5-56ac-eb83ec65be54]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/index"]: Refreshing state... [id=7b1fc858-b05c-d96b-f2ad-3490ddc150ca]
module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/apple-icon.png"]: Refreshing state... [id=a332a419-d362-3df7-56e9-1eaedd0a99c8]
module.single_zone.module.revalidation_function.aws_lambda_alias.lambda_alias["stable"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:stable]
module.single_zone.aws_lambda_event_source_mapping.revalidation_queue_source: Refreshing state... [id=23604771-f7d2-432b-ba67-c4d45c3c7817]
module.single_zone.module.revalidation_function.terraform_data.update_alias[0]: Refreshing state... [id=fd4d9665-d15e-05b0-a99a-29ab584d80e0]
module.single_zone.module.revalidation_function.aws_lambda_function_url.function_url["stable"]: Refreshing state... [id=vltech-website-revalidation-function/stable]
module.single_zone.module.image_optimisation_function[0].aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-image-optimization-function-lambda-policy]
module.single_zone.module.server_function.aws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::615299762949:policy/vltech-website-server-function-lambda-policy]
module.single_zone.data.archive_file.server_function[0]: Reading...
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/webpack-984cbc839a680ab5.js"]: Refreshing state... [id=0326f31c-3e63-6c97-3dcd-1937ad8c78fc]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-8afb5c88d2340613.js"]: Refreshing state... [id=466372c9-168c-2f72-f31f-51cac8590e83]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/c740c1d45290834f-s.woff2"]: Refreshing state... [id=6c695a5c-d238-b55a-e737-abff99fcd32c]
module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/favicon.ico.cache"]: Refreshing state... [id=7359b778-594c-d476-c8c3-7aec8fc3ee2b]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/42aa6e6ea3b85651-s.woff2"]: Refreshing state... [id=59d3c0ee-ae3d-7390-a731-81f5168d647a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/4bd1b696-c579319bb9b05615.js"]: Refreshing state... [id=ac913217-a6e6-32d9-66ab-7bca99b23029]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_error-9b7125ad1a1e68fa.js"]: Refreshing state... [id=75ef6842-85f2-603c-3c4b-cd67c9b9561f]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-image-optimization-function]
module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/500.cache"]: Refreshing state... [id=ee36413f-9268-7ade-95e2-4391034ee081]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/4d1af68a2715a16a-s.p.woff2"]: Refreshing state... [id=e72e9c33-e3f8-1fde-1eb0-6a73205452e8]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/bc270b3a577192a7-s.woff2"]: Refreshing state... [id=16b8f0c3-94b5-168f-1fc9-f51adc0e8a3c]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/517-47d8fb00497672e4.js"]: Refreshing state... [id=a6a618da-575c-c65c-ffec-d19aeebed804]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/framework-a6eb4bce5bd8ed9b.js"]: Refreshing state... [id=2e38b1f6-e9cc-8645-2869-3d55b50564e3]
module.single_zone.module.s3_assets.terraform_data.file_sync["favicon.ico"]: Refreshing state... [id=d538d61d-dce0-cc44-df24-44711711892d]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9f05b6a2725a7318-s.woff2"]: Refreshing state... [id=ac4a618e-66ed-1415-d02d-9d88a4c281ad]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/382b6f43e60580be-s.woff2"]: Refreshing state... [id=02cd3ae0-21e8-4118-e990-2aebe2360167]
module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/index.cache"]: Refreshing state... [id=96824959-76fb-b256-99c2-315a1a1318b9]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/122c360d7fe6d395-s.p.woff2"]: Refreshing state... [id=674ad872-ee9b-89bd-9252-351607ab6caf]
module.single_zone.module.s3_assets.terraform_data.file_sync["assets/vltech_logo.png"]: Refreshing state... [id=5580fd80-287a-0715-aa66-6da5c311462b]
module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"]: Refreshing state... [id=4d177585-f09f-0328-7c34-8f0260d97275]
module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/_not-found.cache"]: Refreshing state... [id=0269ba39-1d53-a0b6-e9f2-4e6842a68b4f]
module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/icon.svg.cache"]: Refreshing state... [id=aaf149e2-15be-05a4-cc7c-b59a5a3532b1]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/a8eac78432f0a60b-s.woff2"]: Refreshing state... [id=9e031051-5705-f03c-c644-4ca8b9261bf5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/357398c3a461852b-s.woff2"]: Refreshing state... [id=e42276e7-9c0c-c131-fdcf-2a5abf5f7666]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/d0697bdd3fb49a78-s.woff2"]: Refreshing state... [id=9076105b-745e-e65e-ec39-f64e126aac2e]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/_not-found/page-b2447a23980919fd.js"]: Refreshing state... [id=86b17e9c-0ff0-125e-e384-6bbaf9c2d977]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/173-fc558b54b5be890b.js"]: Refreshing state... [id=bae8c547-8fd3-1d15-a8aa-1e2e1fb9c4d5]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/7bafef50a4560c1d-s.woff2"]: Refreshing state... [id=271e32ae-abf0-ca24-a29d-49260817d15a]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/01b81fc6c4002686.css"]: Refreshing state... [id=de26967e-7b67-5a54-f6e4-3b45a00acb1c]
module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/sitemap.xml.cache"]: Refreshing state... [id=97c4d60a-8bc1-d69a-6aca-496eae55e349]
module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/cgv.cache"]: Refreshing state... [id=c7d4d5c0-0d15-862d-2cb9-f63ef33bae4d]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/r3Rfpk0qHSRikIaHxjUQX/_buildManifest.js"]: Refreshing state... [id=5dcf9bd2-aa1c-a6e0-f662-77a623690753]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/cgv/page-2f9874ecc3099b18.js"]: Refreshing state... [id=34f45cf6-bb8a-9b44-d95d-0c917d12f956]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/r3Rfpk0qHSRikIaHxjUQX/_ssgManifest.js"]: Refreshing state... [id=3d1b0b7a-b784-06f7-17f2-5f02175d441f]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/9bbb7f84f3601865-s.woff2"]: Refreshing state... [id=325d0d9e-b078-18a5-55c7-a53c90d5c6d5]
module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/apple-icon.png.cache"]: Refreshing state... [id=cd4095e7-28cf-b87e-cb30-ce2614854543]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/978-2e23e15eb2d9825e.js"]: Refreshing state... [id=08c3e02a-0a97-2c74-2cfe-bc127cd57f15]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/polyfills-42372ed130431b0a.js"]: Refreshing state... [id=83abb4c2-13d6-9782-a9c9-1f886e23d3a1]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/pages/_app-d23763e3e6c904ff.js"]: Refreshing state... [id=a0a95740-9bd1-bbc5-3088-e6e5d18fff57]
module.single_zone.module.s3_assets.terraform_data.file_sync["documents/cgv.pdf"]: Refreshing state... [id=c76dce72-1386-d74a-4047-b8fa9d7b4f05]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/media/b32bc20a1e277f31-s.woff2"]: Refreshing state... [id=321d4549-ae06-3830-42eb-cfce7a6e73cf]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/css/b8022cc0231a4bfd.css"]: Refreshing state... [id=715e82b9-4752-4d03-4e14-bba9b5b369bd]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/main-app-d4c84837250c81b8.js"]: Refreshing state... [id=fbe0b5a6-0ff9-f248-fb8d-1f39b44a8105]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/layout-dbf93d4b3b66ee0d.js"]: Refreshing state... [id=f70e794e-46fc-f612-0b45-1bcaab0b96a8]
module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/chunks/app/page-b5896372898a26b5.js"]: Refreshing state... [id=bc9d1baf-5248-765c-dec3-717d504374f3]
module.single_zone.module.image_optimisation_function[0].aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-image-optimization-function-role-20241218205750570200000002]
module.single_zone.module.server_function.aws_iam_role_policy_attachment.policy_attachment: Refreshing state... [id=vltech-website-server-function-role-20241218205750451600000001]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:nextjs]
module.single_zone.module.image_optimisation_function[0].aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:opennext]
module.single_zone.module.image_optimisation_function[0].aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205755531800000003]
module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0]: Refreshing state... [id=bbd63392-87e6-408c-b1b0-3ca2c601ff60]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-image-optimization-function/opennext]
module.single_zone.module.image_optimisation_function[0].aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-image-optimization-function/nextjs]
module.single_zone.data.archive_file.server_function[0]: Read complete after 1s [id=1386bae982ebb4bb54658b720fc5506a1011d8a5]
module.single_zone.module.server_function.aws_lambda_function.lambda_function: Refreshing state... [id=vltech-website-server-function]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["nextjs"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:nextjs]
module.single_zone.module.server_function.aws_lambda_alias.lambda_alias["opennext"]: Refreshing state... [id=arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:opennext]
module.single_zone.module.server_function.aws_lambda_permission.function_url_permission[0]: Refreshing state... [id=terraform-20241218205803707400000004]
module.single_zone.module.server_function.terraform_data.update_alias[0]: Refreshing state... [id=eb914eb1-d5e9-b4b3-b951-0ff17db2d8f3]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["nextjs"]: Refreshing state... [id=vltech-website-server-function/nextjs]
module.single_zone.module.server_function.aws_lambda_function_url.function_url["opennext"]: Refreshing state... [id=vltech-website-server-function/opennext]
module.single_zone.module.public_resources[0].aws_cloudfront_distribution.production_distribution[0]: Refreshing state... [id=EU3DKQFOTEI79]
module.single_zone.module.public_resources[0].aws_route53_record.route53_a_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_A]
module.single_zone.module.public_resources[0].aws_route53_record.route53_aaaa_record["victorlevasseur.tech-false"]: Refreshing state... [id=Z01305181G23H04WP32YA_www.victorlevasseur.tech_AAAA]
module.single_zone.terraform_data.update_aliases[0]: Refreshing state... [id=49c58d79-1f33-2d00-f3ea-d2bf33d20bfb]
module.single_zone.aws_s3_bucket_policy.bucket_policy[0]: Refreshing state... [id=vltech-website-website-bucket]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "2a89c7f45b731fb194a77d8d4ce72056",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "cd9bde48a8372420ceb085eb43f6ec21",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/_not-found/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "a1dfd0b23c22af1dc2a1be51f0695a4a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/_not-found/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "04be4dbd10f893ecfe9c330288a5901f",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "31fdb6afddc75b15df0d1ab697c0715c",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/apple-icon.png/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "936bd711b817ebe4cb80f3f44a6d8200",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/apple-icon.png/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "d5fe10113e906ab9a5f15a956994f2f1",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/cgv"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "7aff440a5ac258684df4868514e88fe9",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/cgv/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "5cc97b40c7097579075cc506437e270a",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/cgv/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "4baddaa38bad8718f0b07c2483afc130",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "1bd1b4a6b88caabd68c3e0cd4daa92a0",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/favicon.ico/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "740fcfdd300863fda725882dc21e6496",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/favicon.ico/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "82565347615a6b629316fca772791a75",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "bb05462d145dc757fc8b7d9f26e75f43",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/icon.svg/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "d71ebd859d603396909d5b00f813ebea",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/icon.svg/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "f924dfbdcb6e5d27d6ac452771a7c384",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/layout-qMcjias9cxqE8SayukU-O/_not-found"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "b6a58b155b6702e7ed64ea6a12955f69",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/layout-qMcjias9cxqE8SayukU-O/apple-icon.png"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "721934d4884e919723f118af98c8db34",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/layout-qMcjias9cxqE8SayukU-O/cgv"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "0feb8a767fbdf818981fcbf02229db79",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/layout-qMcjias9cxqE8SayukU-O/favicon.ico"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "f05d98eaee1d63a9e12758f72db55a62",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/layout-qMcjias9cxqE8SayukU-O/icon.svg"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "cc5fd32a87df1a73f0a5b772b7a08aab",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/layout-qMcjias9cxqE8SayukU-O/index"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "51e03f6d3bddfe3771ec773707a1e23d",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/layout-qMcjias9cxqE8SayukU-O/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "a1b45b6f683053c3b999eb915eb68894",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/page"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "324b929cabb0e3638dbd9458a2f81e64",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/sitemap.xml"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "c98cea5cf5507786ceae6148b5688aac",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/sitemap.xml/layout"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "c9843314d1a0faa87ef7b3cda35328b7",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["qMcjias9cxqE8SayukU-O/_N_T_/sitemap.xml/route"] will be created
  + resource "terraform_data" "isr_table_item" {
      + id               = (known after apply)
      + triggers_replace = [
          + "nextjs",
          + "f72ab7d17c742913be477be526328f28",
        ]
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "74092b7a-5c8e-df5c-38cf-9bdebedaa5d5" -> null
      - triggers_replace = [
          - "nextjs",
          - "2171d9ce1a64dd4a4e61f98e16cc809f",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/_not-found"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "21d805b7-4a6c-9d2c-02c9-678cd14b746c" -> null
      - triggers_replace = [
          - "nextjs",
          - "feae643e69a275bfdc8c76f815bd0b85",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/_not-found/layout"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/_not-found/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "5be345a3-273c-381f-5795-e9fe2ba60508" -> null
      - triggers_replace = [
          - "nextjs",
          - "2692ff4a6e5e0818916a6155f1ed3ae8",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/_not-found/page"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/_not-found/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "dfcec426-fe94-edee-6ae2-9d0cbd141155" -> null
      - triggers_replace = [
          - "nextjs",
          - "ea654dbf079ed38efdd639e3e5c63594",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/apple-icon.png"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "a332a419-d362-3df7-56e9-1eaedd0a99c8" -> null
      - triggers_replace = [
          - "nextjs",
          - "862630b3fc8ec768c97a8acb667b9fb8",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/apple-icon.png/layout"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/apple-icon.png/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "34287888-fa99-1d78-ea57-aa6c0edc4c86" -> null
      - triggers_replace = [
          - "nextjs",
          - "e92808802857a054ebc924b91a2bf6cb",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/apple-icon.png/route"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/apple-icon.png/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "18b6274d-b97b-da96-cfb2-d17e46a57710" -> null
      - triggers_replace = [
          - "nextjs",
          - "62efa922ed790dea68b5a0b90c701cbd",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/cgv"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/cgv"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "7b9c399d-bbfd-c09f-7b26-33d2ffe87d59" -> null
      - triggers_replace = [
          - "nextjs",
          - "b1d0153fdd90e0b02eea3dfd97726b5d",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/cgv/layout"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/cgv/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "1ca5643d-4af6-5fd0-ba47-de8f058ea86e" -> null
      - triggers_replace = [
          - "nextjs",
          - "6c7bbad8272e5a6bf859463323a44551",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/cgv/page"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/cgv/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "351bb9c0-0f58-471f-9fbe-f6144308107e" -> null
      - triggers_replace = [
          - "nextjs",
          - "750fcbe229b22647fe915b93c1feb460",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/favicon.ico"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "9082afe5-99d0-2f6a-5d93-1380e745548b" -> null
      - triggers_replace = [
          - "nextjs",
          - "95edb04cd238963960aab53cea45d6ab",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/favicon.ico/layout"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/favicon.ico/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "2906da3c-eaab-f9c0-e3d8-d9a4f95ef27b" -> null
      - triggers_replace = [
          - "nextjs",
          - "57ae90d833b5e1db9df4514c7d31bc2e",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/favicon.ico/route"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/favicon.ico/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "c8339ce0-1c45-ad88-2132-1674312854e4" -> null
      - triggers_replace = [
          - "nextjs",
          - "8202075ea54ff3fecd7ca260089cb92b",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/icon.svg"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "d3d20e9c-376f-f2e6-e3b9-288d155543e8" -> null
      - triggers_replace = [
          - "nextjs",
          - "985974bf3fb7b11b603f00356fa45ec9",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/icon.svg/layout"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/icon.svg/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "5c5acc8b-2aa1-32a8-98ff-c6fb9400112f" -> null
      - triggers_replace = [
          - "nextjs",
          - "70105a3f7cbd47cff6975157aa00022b",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/icon.svg/route"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/icon.svg/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "5babcda4-3126-bd91-1e4c-4ea052491582" -> null
      - triggers_replace = [
          - "nextjs",
          - "2d8cdf9a886428a1bab7d92a0c84b446",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/_not-found"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/_not-found"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "77467906-be1b-57fe-87fa-4b54b2e9ce02" -> null
      - triggers_replace = [
          - "nextjs",
          - "ea1f7e620a505f93a9c2d72b5e6604a8",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/apple-icon.png"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/apple-icon.png"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "a8eec600-d9eb-21ce-fc0d-dd77945a7e11" -> null
      - triggers_replace = [
          - "nextjs",
          - "55c555c6548a3604d5a1f4d6f85d0025",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/cgv"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/cgv"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "899bda51-4dac-f585-ac7b-8cbad450fd98" -> null
      - triggers_replace = [
          - "nextjs",
          - "336ce551f8c255e4af18d91eb7574170",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/favicon.ico"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/favicon.ico"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "d05a4d8c-3fa9-b1c5-56ac-eb83ec65be54" -> null
      - triggers_replace = [
          - "nextjs",
          - "b9b1c922e476d44624ed47f88db12a10",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/icon.svg"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/icon.svg"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "174d39b7-0ef8-aefe-90d3-81179388dfd2" -> null
      - triggers_replace = [
          - "nextjs",
          - "e23df87c75edf1b038b0d87aa1c425e4",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/index"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/index"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "7b1fc858-b05c-d96b-f2ad-3490ddc150ca" -> null
      - triggers_replace = [
          - "nextjs",
          - "a98a3a0fce8204dab2454213d7a9226b",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/sitemap.xml"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/layout-r3Rfpk0qHSRikIaHxjUQX/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "9a3ed01b-5ae6-a5cc-96c1-a08b4ced16ce" -> null
      - triggers_replace = [
          - "nextjs",
          - "a96617850466649085e48bb82e6e2fb0",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/page"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/page"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "a7679c53-8bd4-65ac-cd11-ad1dcdb5d108" -> null
      - triggers_replace = [
          - "nextjs",
          - "d8a0464c1618396490896417e0ffa07a",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/sitemap.xml"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/sitemap.xml"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "f4464299-75c6-b2c4-b5f8-c10ddd3dd645" -> null
      - triggers_replace = [
          - "nextjs",
          - "212ad412ad66441517ef46216e6f8c6c",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/sitemap.xml/layout"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/sitemap.xml/layout"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "aa59df35-b141-433d-317e-26f2085561c5" -> null
      - triggers_replace = [
          - "nextjs",
          - "c1eed31db3eba9334546014485208671",
        ] -> null
    }

  # module.single_zone.terraform_data.isr_table_item["r3Rfpk0qHSRikIaHxjUQX/_N_T_/sitemap.xml/route"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_N_T_/sitemap.xml/route"] is not in for_each map)
  - resource "terraform_data" "isr_table_item" {
      - id               = "e8535260-7e85-9cc7-9c99-b9cdb06bb020" -> null
      - triggers_replace = [
          - "nextjs",
          - "4accf0151c9aecb5c39f6091dba0c286",
        ] -> null
    }

  # module.single_zone.module.image_optimisation_function[0].aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-image-optimization-function"
      ~ last_modified                  = "2025-02-21T15:58:37.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-image-optimization-function:18/invocations" -> (known after apply)
      ~ source_code_hash               = "dr6RgvKRF4aFPimU/1cBHRA5kHfHFPX/vmZP+WbNihE=" -> "fS2hpjFYFpIYtb2UCUBdRpLz6WKhT+ijvr2uaqvA89Q="
        tags                           = {}
      ~ version                        = "18" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.image_optimisation_function[0].terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "bbd63392-87e6-408c-b1b0-3ca2c601ff60" -> (known after apply)
      ~ triggers_replace = [
          ~ "18" -> (known after apply),
            "nextjs",
        ]
    }

  # module.single_zone.module.revalidation_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-revalidation-function"
      ~ last_modified                  = "2025-02-21T15:58:25.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-revalidation-function:18/invocations" -> (known after apply)
      ~ source_code_hash               = "421v8lxBC9SWL+hx8SIS3MN2abzrWevJ9gBgFnErF90=" -> "2pWwb8UWM82a4LHzjogbOiGcn6cS2qNI0JKqUyB72R0="
        tags                           = {}
      ~ version                        = "18" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.single_zone.module.revalidation_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "fd4d9665-d15e-05b0-a99a-29ab584d80e0" -> (known after apply)
      ~ triggers_replace = [
          ~ "18" -> (known after apply),
            "stable",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["BUILD_ID"] must be replaced
-/+ resource "terraform_data" "file_sync" {
      ~ id               = "4d177585-f09f-0328-7c34-8f0260d97275" -> (known after apply)
      ~ triggers_replace = [
            # (1 unchanged element hidden)
            "nextjs",
          ~ "b075fb6e3f8b67d456e46cd8ed5d005c" -> "f5a3a62591cce1e388022e64adaa5bd1",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/qMcjias9cxqE8SayukU-O/_buildManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9a9bc883f7801dfd30597cebfafa30d0",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/qMcjias9cxqE8SayukU-O/_ssgManifest.js"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "b404e23d62d95bafd03ad7747cc0e88b",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/r3Rfpk0qHSRikIaHxjUQX/_buildManifest.js"] will be destroyed
  # (because key ["_next/static/r3Rfpk0qHSRikIaHxjUQX/_buildManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "5dcf9bd2-aa1c-a6e0-f662-77a623690753" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9a9bc883f7801dfd30597cebfafa30d0",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["_next/static/r3Rfpk0qHSRikIaHxjUQX/_ssgManifest.js"] will be destroyed
  # (because key ["_next/static/r3Rfpk0qHSRikIaHxjUQX/_ssgManifest.js"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "3d1b0b7a-b784-06f7-17f2-5f02175d441f" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "b404e23d62d95bafd03ad7747cc0e88b",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["qMcjias9cxqE8SayukU-O/500.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "a5337315cf308ed4c9cd2135d2c2c41d",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["qMcjias9cxqE8SayukU-O/_not-found.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "bfa1560f26c29e548f5b52b8dc03b037",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["qMcjias9cxqE8SayukU-O/apple-icon.png.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "9843a61c98627e227286769373becd10",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["qMcjias9cxqE8SayukU-O/cgv.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "720e07a16a8b3383f62c3f57c51b51d9",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["qMcjias9cxqE8SayukU-O/favicon.ico.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "1253a11e7fded511c766a255028ab4ee",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["qMcjias9cxqE8SayukU-O/icon.svg.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "31e8b96a370a0c0409d732d5d9c1d2d6",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["qMcjias9cxqE8SayukU-O/index.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "c8e8785bcce4afb6a87d7f6feeca8b65",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["qMcjias9cxqE8SayukU-O/sitemap.xml.cache"] will be created
  + resource "terraform_data" "file_sync" {
      + id               = (known after apply)
      + triggers_replace = [
          + null,
          + "nextjs",
          + "e873b3f94baf7c5005692b21341fb94e",
        ]
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/500.cache"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/500.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "ee36413f-9268-7ade-95e2-4391034ee081" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "7ff2a4b0a70658990c5a8925900eb548",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/_not-found.cache"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/_not-found.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "0269ba39-1d53-a0b6-e9f2-4e6842a68b4f" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "5c1b448542dcacae6597e4439610ada7",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/apple-icon.png.cache"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/apple-icon.png.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "cd4095e7-28cf-b87e-cb30-ce2614854543" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "9843a61c98627e227286769373becd10",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/cgv.cache"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/cgv.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "c7d4d5c0-0d15-862d-2cb9-f63ef33bae4d" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "96ff7e257cbbe4450db7f5fe7134b910",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/favicon.ico.cache"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/favicon.ico.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "7359b778-594c-d476-c8c3-7aec8fc3ee2b" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "1253a11e7fded511c766a255028ab4ee",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/icon.svg.cache"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/icon.svg.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "aaf149e2-15be-05a4-cc7c-b59a5a3532b1" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "31e8b96a370a0c0409d732d5d9c1d2d6",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/index.cache"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/index.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "96824959-76fb-b256-99c2-315a1a1318b9" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "e67aa83272c68fb51230c074cde05ea4",
        ] -> null
    }

  # module.single_zone.module.s3_assets.terraform_data.file_sync["r3Rfpk0qHSRikIaHxjUQX/sitemap.xml.cache"] will be destroyed
  # (because key ["r3Rfpk0qHSRikIaHxjUQX/sitemap.xml.cache"] is not in for_each map)
  - resource "terraform_data" "file_sync" {
      - id               = "97c4d60a-8bc1-d69a-6aca-496eae55e349" -> null
      - triggers_replace = [
          - null,
          - "nextjs",
          - "c3596ee85d163224f908625ccb3a8f6a",
        ] -> null
    }

  # module.single_zone.module.server_function.aws_lambda_function.lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "lambda_function" {
        id                             = "vltech-website-server-function"
      ~ last_modified                  = "2025-02-21T15:58:48.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:18" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-central-1:615299762949:function:vltech-website-server-function:18/invocations" -> (known after apply)
      ~ source_code_hash               = "VNkkIBH3IkqoVFDk0Oho1scugZt1rNUGTX2Sh7fJNZ4=" -> "UkwoqXfr73AQGFqzmSugiHPN10Jgn0CH7LbOueCJNVI="
        tags                           = {}
      ~ version                        = "18" -> (known after apply)
        # (24 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.single_zone.module.server_function.terraform_data.update_alias[0] must be replaced
-/+ resource "terraform_data" "update_alias" {
      ~ id               = "eb914eb1-d5e9-b4b3-b951-0ff17db2d8f3" -> (known after apply)
      ~ triggers_replace = [
          ~ "18" -> (known after apply),
            "nextjs",
        ]
    }

Plan: 41 to add, 3 to change, 41 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @dependabot[bot], Action: `pull_request`, Working Directory: `terraform`, Workflow: `PR Checks`*